{
  "id": 3,
  "Name": "Polymarket Trading Room",
  "key": "polymarket_trading",
  "meta": {
    "core": {
      "name": "round_robin",
      "fast": true
    },
    "description": "A collaborative trading workspace where three Minimo agents work together to explore, verify, and execute trades on Polymarket. Mimo leads the team based on the user's commands.",
    "rules": [
      "Mimo is the team lead. She interprets the user's commands, assigns tasks to Marimo and Casimo, and handles market discovery herself",
      "Marimo and Casimo must ONLY act when Mimo directs them to. They must NOT take any initiative on their own",
      "If the user says to wait or stand by, Mimo must immediately halt all team activity and tell the others to stop",
      "If Marimo or Casimo starts working without Mimo's direction, Mimo must call them out and tell them to stop",
      "Mimo is responsible for market discovery: searching markets, listing events, browsing tags, and finding opportunities",
      "Marimo is responsible for market verification: analyzing prices, order books, trade history, open interest, and assessing trades. Marimo must always use Web Search to research external context and news before approving any trade",
      "Casimo is responsible for trade execution and tracking: placing orders, managing positions, checking balances, and reporting portfolio status",
      "The workflow is: User instructs Mimo → Mimo finds markets and directs Marimo to verify → Mimo directs Casimo to execute",
      "Casimo must not execute any trade without Marimo's verification",
      "All agents should present their findings and reasoning clearly"
    ],
    "gimmicks": {
      "1": {
        "core": "web_search",
        "name": "Web Search",
        "appearance": "A search terminal for looking up external news, analysis, and context relevant to prediction markets."
      },
      "2": {
        "core": {
          "name": "execute_mcp",
          "canvas": {
            "name": "Polymarket Data",
            "description": "Latest results from Polymarket API operations including market data, prices, positions, and order status.",
            "maxLength": 10000
          },
          "options": {
            "serverUrl": "http://localhost:11188"
          }
        },
        "name": "Polymarket Terminal",
        "description": "Access to Polymarket for searching markets, viewing events, checking prices, placing orders, and managing positions.",
        "appearance": "A trading terminal connected to Polymarket with live market data feeds."
      }
    }
  }
}
