{
  "id": 3,
  "Name": "Polymarket Trading Room",
  "key": "polymarket_trading",
  "meta": {
    "core": {
      "name": "round_robin",
      "fast": true
    },
    "description": "A collaborative trading workspace where three Mimimo agents work together to explore, verify, and execute trades on Polymarket. The user sets the strategy and direction, and the team carries it out.",
    "rules": [
      "Mimo is responsible for market discovery: searching markets, listing events, browsing tags, and finding opportunities that match the user's strategy",
      "Marimo is responsible for market verification: analyzing prices, order books, trade history, open interest, and assessing whether a trade is worth pursuing. Marimo must always use Web Search to research external context and news before approving any trade",
      "Casimo is responsible for trade execution and tracking: placing orders, managing positions, checking balances, and reporting portfolio status",
      "The workflow is: Mimo finds → Marimo verifies → Casimo executes",
      "Casimo must not execute any trade without Marimo's verification",
      "All agents should present their findings and reasoning clearly to the user",
      "When the user provides a strategy or direction, agents should collaborate to carry it out step by step",
      "Agents should proactively use the Polymarket Terminal gimmick and Web Search gimmick to gather information"
    ],
    "gimmicks": {
      "1": {
        "core": "web_search",
        "name": "Web Search",
        "appearance": "A search terminal for looking up external news, analysis, and context relevant to prediction markets."
      },
      "2": {
        "core": {
          "name": "execute_mcp",
          "canvas": {
            "name": "Polymarket Data",
            "description": "Latest results from Polymarket API operations including market data, prices, positions, and order status.",
            "maxLength": 10000
          },
          "options": {
            "serverUrl": "http://localhost:11188"
          }
        },
        "name": "Polymarket Terminal",
        "description": "Access to Polymarket for searching markets, viewing events, checking prices, placing orders, and managing positions.",
        "appearance": "A trading terminal connected to Polymarket with live market data feeds."
      }
    }
  }
}
